In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

In [2]:
%%sql
SELECT *
    FROM invoice_line
    LIMIT 2

 * sqlite:///chinook.db
Done.

[(1, 1, 1158, 0.99, 1), (2, 1, 1159, 0.99, 1)]

In [3]:
%%sql
SELECT name
    FROM sqlite_master
    WHERE type IN ('table')

 * sqlite:///chinook.db
Done.

[('album',),
 ('artist',),
 ('customer',),
 ('employee',),
 ('genre',),
 ('invoice',),
 ('invoice_line',),
 ('media_type',),
 ('playlist',),
 ('playlist_track',),
 ('track',)]

In [4]:
%%sql
SELECT *
    FROM invoice_line
    LIMIT 2

 * sqlite:///chinook.db
Done.

[(1, 1, 1158, 0.99, 1), (2, 1, 1159, 0.99, 1)]

In [5]:
%%sql
SELECT *
    FROM track
    LIMIT 2

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99)]

In [6]:
%%sql
SELECT * FROM media_type LIMIT 2

 * sqlite:///chinook.db
Done.

[(1, 'MPEG audio file'), (2, 'Protected AAC audio file')]

In [7]:
%%sql
SELECT COUNT(*) FROM invoice_line

 * sqlite:///chinook.db
Done.

[(4757,)]

In [8]:
%%sql
SELeCT * FROM invoice_line WHERE invoice_id = 3

 * sqlite:///chinook.db
Done.

[(27, 3, 2516, 0.99, 1), (28, 3, 2646, 0.99, 1)]

In [9]:
%%sql
SELECT * FROM invoice_line il
INNER JOIN track t ON t.track_id = il.track_id
WHERE invoice_id = 3

 * sqlite:///chinook.db
Done.

[(27, 3, 2516, 0.99, 1, 2516, 'Black Hole Sun', 203, 1, 1, 'Soundgarden', 320365, 10425229, 0.99),
 (28, 3, 2646, 0.99, 1, 2646, 'I Looked At You', 214, 1, 1, 'Robby Krieger, Ray Manzarek, John Densmore, Jim Morrison', 142080, 4663988, 0.99)]

In [10]:
%%sql
SELECT *
    FROM invoice_line il
    INNER JOIN track t ON t.track_id = il.track_id
    INNER JOIN media_type mt ON mt.media_type_id = t.media_type_id
    WHERE invoice_id = 3

 * sqlite:///chinook.db
Done.

[(27, 3, 2516, 0.99, 1, 2516, 'Black Hole Sun', 203, 1, 1, 'Soundgarden', 320365, 10425229, 0.99, 1, 'MPEG audio file'),
 (28, 3, 2646, 0.99, 1, 2646, 'I Looked At You', 214, 1, 1, 'Robby Krieger, Ray Manzarek, John Densmore, Jim Morrison', 142080, 4663988, 0.99, 1, 'MPEG audio file')]

In [11]:
%%sql
SELECT il.track_id, t.name AS track_name, at.name AS artist_name, mt.name AS track_type, il.unit_price, il.quantity
    FROM invoice_line il
    INNER JOIN track t ON t.track_id = il.track_id
    INNER JOIN media_type mt ON mt.media_type_id = t.media_type_id
    INNER JOIN album ab ON ab.album_id = t.album_id
    INNER JOIN artist at ON at.artist_id = ab.artist_id
    WHERE il.invoice_id = 4

 * sqlite:///chinook.db
Done.

[(3448, 'Lamentations of Jeremiah, First Set \\ Incipit Lamentatio', "The King's Singers", 'Protected AAC audio file', 0.99, 1),
 (2560, 'Violent Pornography', 'System Of A Down', 'MPEG audio file', 0.99, 1),
 (3336, 'War Pigs', 'Cake', 'Purchased AAC audio file', 0.99, 1),
 (829, "Let's Get Rocked", 'Def Leppard', 'MPEG audio file', 0.99, 1),
 (1872, 'Attitude', 'Metallica', 'MPEG audio file', 0.99, 1),
 (748, 'Dealer', 'Deep Purple', 'MPEG audio file', 0.99, 1),
 (1778, "You're What's Happening (In The World Today)", 'Marvin Gaye', 'MPEG audio file', 0.99, 1),
 (2514, 'Spoonman', 'Soundgarden', 'MPEG audio file', 0.99, 1)]

In [12]:
%%sql
SELECT t.track_id, ar.name artist_name
    FROM track t
    INNER JOIN album al on al.album_id = t.album_id
    INNER JOIN artist ar ON ar.artist_id = al.artist_id
    ORDER BY 1
    LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 'AC/DC'), (2, 'Accept'), (3, 'Accept'), (4, 'Accept'), (5, 'Accept')]

In [13]:
%%sql
SELECT il.invoice_line_id, il.track_id, ta.artist_name
    FROM invoice_line il
    INNER JOIN (
                SELECT t.track_id, ar.name artist_name
                FROM track t
                INNER JOIN album al ON al.album_id = t.album_id
                INNER JOIN artist ar ON ar.artist_id = al.artist_id)
                ta ON ta.track_id = il.track_id
    ORDER BY 1
    LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 1158, "Guns N' Roses"),
 (2, 1159, "Guns N' Roses"),
 (3, 1160, "Guns N' Roses"),
 (4, 1161, "Guns N' Roses"),
 (5, 1162, "Guns N' Roses")]

In [14]:
%%sql
SELECT ta.artist_name, COUNT(*) tracks_purchased
    FROM invoice_line il
    INNER JOIN (
                SELECT t.track_id, ar.name artist_name
                FROM track t
                INNER JOIN album al ON al.album_id = t.album_id
                INNER JOIN artist ar ON ar.artist_id = al.artist_id)
                ta ON ta.track_id = il.track_id
    GROUP BY 1
    ORDER BY 2 DESC 
    
    LIMIT 10

 * sqlite:///chinook.db
Done.

[('Queen', 192),
 ('Jimi Hendrix', 187),
 ('Red Hot Chili Peppers', 130),
 ('Nirvana', 130),
 ('Pearl Jam', 129),
 ("Guns N' Roses", 124),
 ('AC/DC', 124),
 ('Foo Fighters', 121),
 ('The Rolling Stones', 117),
 ('Metallica', 106)]

In [15]:
%%sql
SELECT ta.album, ta.artist, SUM(il.quantity) AS tracks_purchased
    FROM invoice_line il
    INNER JOIN (SELECT t.track_id,al.title AS album, ar.name AS artist
               FROM track t
               INNER JOIN album al ON al.album_id = t.album_id
               INNER JOIN artist ar ON ar.artist_id = al.artist_id)
                ta ON ta.track_id = il.track_id
    GROUP BY 1
    ORDER BY 3 DESC
    LIMIT 5

 * sqlite:///chinook.db
Done.

[('Are You Experienced?', 'Jimi Hendrix', 187),
 ('Faceless', 'Godsmack', 96),
 ('Mezmerize', 'System Of A Down', 93),
 ('Get Born', 'JET', 90),
 ('The Doors', 'The Doors', 83)]

In [16]:
%%sql
SELECT e1.employee_id, e2.employee_id supervisor_id
    FROM employee e1
    INNER JOIN employee e2 ON e1.reports_to = e2.employee_id
    LIMIT 4;

 * sqlite:///chinook.db
Done.

[(2, 1), (6, 1), (3, 2), (4, 2)]

In [17]:
%%sql
SELECT album_id, artist_id, "album id is" || album_id col1, "artist id is" || artist_id col2, album_id || artist_id col3
    FROM album LIMIT 3

 * sqlite:///chinook.db
Done.

[(1, 1, 'album id is1', 'artist id is1', '11'),
 (4, 1, 'album id is4', 'artist id is1', '41'),
 (2, 2, 'album id is2', 'artist id is2', '22')]

In [18]:
%%sql
SELECT e1.first_name || " " || e1.last_name AS employee_name, e1.title AS employee_title, 
       e2.first_name || " " || e2.last_name AS supervisor_name, e2.title AS supervisor_title
    FROM employee e1
    LEFT JOIN employee e2 ON e1.reports_to = e2.employee_id
    ORDER BY employee_name
    LIMIT 5

 * sqlite:///chinook.db
Done.

[('Andrew Adams', 'General Manager', None, None),
 ('Jane Peacock', 'Sales Support Agent', 'Nancy Edwards', 'Sales Manager'),
 ('Laura Callahan', 'IT Staff', 'Michael Mitchell', 'IT Manager'),
 ('Margaret Park', 'Sales Support Agent', 'Nancy Edwards', 'Sales Manager'),
 ('Michael Mitchell', 'IT Manager', 'Andrew Adams', 'General Manager')]

In [19]:
%%sql
SELECT first_name, last_name, phone
    FROM customer
    WHERE first_name LIKE "%Belle%"

 * sqlite:///chinook.db
Done.

[('Isabelle', 'Mercier', '+33 03 80 73 66 99')]

In [20]:
%%sql
SELECT media_type_id, name,
        CASE 
            WHEN name LIKE "%Protected%" THEN 1
            ELSE 0
            END
            AS Protected
    FROM media_type

 * sqlite:///chinook.db
Done.

[(1, 'MPEG audio file', 0),
 (2, 'Protected AAC audio file', 1),
 (3, 'Protected MPEG-4 video file', 1),
 (4, 'Purchased AAC audio file', 0),
 (5, 'AAC audio file', 0)]

In [21]:
%%sql
SELECT c.first_name||" "||c.last_name AS customer_name, COUNT(*) AS number_of_purchases, SUM(i.total) AS total_spent,
     CASE 
        WHEN SUM(i.total) < 40 THEN "small spender"
        WHEN SUM(i.total) <= 100 THEN "regular"
        ELSE "big spender"
        END
        AS customer_category
    FROM customer c
    INNER JOIN invoice i ON i.customer_id = c.customer_id
    GROUP BY 1
    ORDER BY 1
    LIMIT 5

 * sqlite:///chinook.db
Done.

[('Aaron Mitchell', 8, 70.28999999999999, 'regular'),
 ('Alexandre Rocha', 10, 69.3, 'regular'),
 ('Astrid Gruber', 9, 69.3, 'regular'),
 ('Bjørn Hansen', 9, 72.27000000000001, 'regular'),
 ('Camille Bernard', 9, 79.2, 'regular')]

In [22]:
%%sql
    SELECT 
        ta.artist_name artist,
        COUNT(*) tracks_sold
    FROM invoice_line il
    INNER JOIN (SELECT 
                   t.track_id,
                   ar.name artist_name
               FROM track t
               INNER JOIN album al ON al.album_id = t.album_id
               INNER JOIN artist ar ON ar.artist_id = al.artist_id
               ) ta
            ON ta.track_id = il.track_id
    GROUP BY 1
    ORDER BY 2 DESC LIMIT 10

 * sqlite:///chinook.db
Done.

[('Queen', 192),
 ('Jimi Hendrix', 187),
 ('Red Hot Chili Peppers', 130),
 ('Nirvana', 130),
 ('Pearl Jam', 129),
 ("Guns N' Roses", 124),
 ('AC/DC', 124),
 ('Foo Fighters', 121),
 ('The Rolling Stones', 117),
 ('Metallica', 106)]

In [23]:
%%sql
SELECT * FROM
    (SELECT t.name,
            ar.name artist,
            al.title album_name,
            mt.name media_type,
            g.name genre,
            t.milliseconds length_milliseconds
    FROM track t
    INNER JOIN media_type mt ON mt.media_type_id = t.media_type_id
    INNER JOIN genre g ON g.genre_id = t.genre_id
    INNER JOIN album al ON al.album_id = t.album_id
    INNER JOIN artist ar ON ar.artist_id = al.artist_id
    )
WHERE album_name = 'Jagged Little Pill'

 * sqlite:///chinook.db
Done.

[('All I Really Want', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 284891),
 ('You Oughta Know', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 249234),
 ('Perfect', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 188133),
 ('Hand In My Pocket', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 221570),
 ('Right Through You', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 176117),
 ('Forgiven', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 300355),
 ('You Learn', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 239699),
 ('Head Over Feet', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 267493),
 ('Mary Jane', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 280607),
 ('Ironic', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 229825),
 ('Not The Doctor', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 227631),
 ('Wake Up', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 293485),
 ('You Oughta Know (Alternate)', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 491885)]

In [24]:
%%sql
WITH track_info AS
    (SELECT t.name,
            ar.name artist,
            al.title album_name,
            mt.name media_type,
            g.name genre,
            t.milliseconds length_milliseconds
    FROM track t
    INNER JOIN media_type mt ON mt.media_type_id = t.media_type_id
    INNER JOIN genre g ON g.genre_id = t.genre_id
    INNER JOIN album al ON al.album_id = t.album_id
    INNER JOIN artist ar ON ar.artist_id = al.artist_id)
SELECT * FROM track_info
WHERE album_name = "Jagged Little Pill"

 * sqlite:///chinook.db
Done.

[('All I Really Want', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 284891),
 ('You Oughta Know', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 249234),
 ('Perfect', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 188133),
 ('Hand In My Pocket', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 221570),
 ('Right Through You', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 176117),
 ('Forgiven', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 300355),
 ('You Learn', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 239699),
 ('Head Over Feet', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 267493),
 ('Mary Jane', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 280607),
 ('Ironic', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 229825),
 ('Not The Doctor', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 227631),
 ('Wake Up', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 293485),
 ('You Oughta Know (Alternate)', 'Alanis Morissette', 'Jagged Little Pill', 'MPEG audio file', 'Rock', 491885)]

In [25]:
%%sql
WITH playlist_info AS
    (SELECT pl.playlist_id, 
            pl.name AS playlist_name, 
            t.name AS track_name, 
            t.milliseconds/ 1000 length_seconds
     FROM playlist pl
     LEFT JOIN playlist_track pt ON pt.playlist_id = pl.playlist_id
     LEFT JOIN track t ON t.track_id = pt.track_id)
SELECT playlist_id, playlist_name, COUNT(track_name) number_of_tracks, SUM(length_seconds)
FROM playlist_info
GROUP BY 1,2
ORDER BY 1

 * sqlite:///chinook.db
Done.

[(1, 'Music', 3290, 876049),
 (2, 'Movies', 0, None),
 (3, 'TV Shows', 213, 500987),
 (4, 'Audiobooks', 0, None),
 (5, '90’s Music', 1477, 397970),
 (6, 'Audiobooks', 0, None),
 (7, 'Movies', 0, None),
 (8, 'Music', 3290, 876049),
 (9, 'Music Videos', 1, 294),
 (10, 'TV Shows', 213, 500987),
 (11, 'Brazilian Music', 39, 9464),
 (12, 'Classical', 75, 21736),
 (13, 'Classical 101 - Deep Cuts', 25, 6742),
 (14, 'Classical 101 - Next Steps', 25, 7565),
 (15, 'Classical 101 - The Basics', 25, 7429),
 (16, 'Grunge', 15, 4114),
 (17, 'Heavy Metal Classic', 26, 8189),
 (18, 'On-The-Go 1', 1, 197)]

In [26]:
%%sql
WITH playlist_info AS
    (
     SELECT
         p.playlist_id,
         p.name playlist_name,
         t.name track_name,
         (t.milliseconds / 1000) length_seconds
     FROM playlist p
     LEFT JOIN playlist_track pt ON pt.playlist_id = p.playlist_id
     LEFT JOIN track t ON t.track_id = pt.track_id
    )

SELECT
    playlist_id,
    playlist_name,
    COUNT(track_name) number_of_tracks,
    SUM(length_seconds) length_seconds
FROM playlist_info
GROUP BY 1, 2
ORDER BY 1;

 * sqlite:///chinook.db
Done.

[(1, 'Music', 3290, 876049),
 (2, 'Movies', 0, None),
 (3, 'TV Shows', 213, 500987),
 (4, 'Audiobooks', 0, None),
 (5, '90’s Music', 1477, 397970),
 (6, 'Audiobooks', 0, None),
 (7, 'Movies', 0, None),
 (8, 'Music', 3290, 876049),
 (9, 'Music Videos', 1, 294),
 (10, 'TV Shows', 213, 500987),
 (11, 'Brazilian Music', 39, 9464),
 (12, 'Classical', 75, 21736),
 (13, 'Classical 101 - Deep Cuts', 25, 6742),
 (14, 'Classical 101 - Next Steps', 25, 7565),
 (15, 'Classical 101 - The Basics', 25, 7429),
 (16, 'Grunge', 15, 4114),
 (17, 'Heavy Metal Classic', 26, 8189),
 (18, 'On-The-Go 1', 1, 197)]

In [27]:
%%sql
CREATE VIEW customer_2 AS
    SELECT * FROM customer;
DROP VIEW customer_2;

 * sqlite:///chinook.db
Done.
Done.

[]

In [28]:
%%sql 
CREATE VIEW customer_usa AS
    SELECT * FROM customer
    WHERE country = "USA";

CREATE VIEW customer_gt_90_dollars AS
    SELECT c.*
        FROM customer c
        INNER JOIN invoice i ON c.customer_id = i.customer_id
        GROUP BY i.customer_id
        HAVING SUM(i.total) > 90

 * sqlite:///chinook.db
(sqlite3.OperationalError) table customer_usa already exists
[SQL: CREATE VIEW customer_usa AS
    SELECT * FROM customer
    WHERE country = "USA";]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [29]:
%%sql
SELECT c.*
        FROM customer c
        INNER JOIN invoice i ON c.customer_id = i.customer_id
        GROUP BY i.customer_id
        HAVING SUM(i.total) > 90
        LIMIT 3

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [30]:
%%sql 
SELECT *, SUM(total) 
FROM invoice 
GROUP BY customer_id
HAVING SUM(total) > 90
LIMIT 3

 * sqlite:///chinook.db
Done.

[(16, 1, '2017-01-26 00:00:00', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', 8.91, 108.89999999999998),
 (31, 3, '2017-02-21 00:00:00', '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', 19.8, 99.99),
 (78, 5, '2017-05-29 00:00:00', 'Klanova 9/506', 'Prague', 'None', 'Czech Republic', '14700', 8.91, 144.54000000000002)]

In [31]:
%%sql
SELECT *
    FROM customer_usa
UNION
SELECT *
    FROM customer_gt_90_dollars
LIMIT 3

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [32]:
%%sql
SELECT * FROM customer_usa
INTERSECT 
SELECT * FROM customer_gt_90_dollars

 * sqlite:///chinook.db
Done.

[(17, 'Jack', 'Smith', 'Microsoft Corporation', '1 Microsoft Way', 'Redmond', 'WA', 'USA', '98052-8300', '+1 (425) 882-8080', '+1 (425) 882-8081', 'jacksmith@microsoft.com', 5),
 (20, 'Dan', 'Miller', None, '541 Del Medio Avenue', 'Mountain View', 'CA', 'USA', '94040-111', '+1 (650) 644-3358', None, 'dmiller@comcast.com', 4),
 (21, 'Kathy', 'Chase', None, '801 W 4th Street', 'Reno', 'NV', 'USA', '89503', '+1 (775) 223-7665', None, 'kachase@hotmail.com', 5),
 (22, 'Heather', 'Leacock', None, '120 S Orange Ave', 'Orlando', 'FL', 'USA', '32801', '+1 (407) 999-7788', None, 'hleacock@gmail.com', 4)]

In [33]:
%%sql
SELECT * FROM customer_usa
EXCEPT
SELECT * FROM customer_gt_90_dollars

 * sqlite:///chinook.db
Done.

[(16, 'Frank', 'Harris', 'Google Inc.', '1600 Amphitheatre Parkway', 'Mountain View', 'CA', 'USA', '94043-1351', '+1 (650) 253-0000', '+1 (650) 253-0000', 'fharris@google.com', 4),
 (18, 'Michelle', 'Brooks', None, '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', '+1 (212) 221-3546', '+1 (212) 221-4679', 'michelleb@aol.com', 3),
 (19, 'Tim', 'Goyer', 'Apple Inc.', '1 Infinite Loop', 'Cupertino', 'CA', 'USA', '95014', '+1 (408) 996-1010', '+1 (408) 996-1011', 'tgoyer@apple.com', 3),
 (23, 'John', 'Gordon', None, '69 Salem Street', 'Boston', 'MA', 'USA', '2113', '+1 (617) 522-1333', None, 'johngordon22@yahoo.com', 4),
 (24, 'Frank', 'Ralston', None, '162 E Superior Street', 'Chicago', 'IL', 'USA', '60611', '+1 (312) 332-3232', None, 'fralston@gmail.com', 3),
 (25, 'Victor', 'Stevens', None, '319 N. Frances Street', 'Madison', 'WI', 'USA', '53703', '+1 (608) 257-0597', None, 'vstevens@yahoo.com', 5),
 (26, 'Richard', 'Cunningham', None, '2211 W Berry Street', 'Fort Worth', 'TX', 'USA', '76110', '+1 (817) 924-7272', None, 'ricunningham@hotmail.com', 4),
 (27, 'Patrick', 'Gray', None, '1033 N Park Ave', 'Tucson', 'AZ', 'USA', '85719', '+1 (520) 622-4200', None, 'patrick.gray@aol.com', 4),
 (28, 'Julia', 'Barnett', None, '302 S 700 E', 'Salt Lake City', 'UT', 'USA', '84102', '+1 (801) 531-7272', None, 'jubarnett@gmail.com', 5)]

In [34]:
%%sql 
SELECT e.first_name || " " || e.last_name AS employee_name, COUNT(usa90.customer_id) AS customers_usa_gt_90
    FROM employee e
    LEFT JOIN (SELECT * FROM customer_usa INTERSECT SELECT * FROM customer_gt_90_dollars) usa90 
                ON e.employee_id = usa90.support_rep_id
    WHERE e.title = 'Sales Support Agent'
    GROUP BY usa90.support_rep_id
    ORDER BY 1;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', 0), ('Margaret Park', 2), ('Steve Johnson', 2)]

In [35]:
%%sql
WITH customers_usa_gt_90 AS
    (SELECT * FROM customer_usa
     INTERSECT 
     SELECT * FROM customer_gt_90_dollars)
SELECT 
    e.first_name||" "||e.last_name employee_name,
    COUNT(c.customer_id) customer_usa_gt_90
FROM employee e
LEFT JOIN customers_usa_gt_90 c ON c.support_rep_id = e.employee_id
WHERE e.title = 'Sales Support Agent'
GROUP BY 1 ORDER BY 1;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', 0), ('Margaret Park', 2), ('Steve Johnson', 2)]

In [36]:
%%sql
WITH 
    usa AS
     (SELECT * FROM customer
      WHERE country = "USA"),
    last_name_g AS
    (SELECT * FROM usa 
        WHERE last_name LIKE "G%"),
    state_ca AS
        (SELECT * FROM last_name_g
        WHERE state = 'CA')
SELECT 
    first_name,
    last_name,
    country,
    state
FROM state_ca

 * sqlite:///chinook.db
Done.

[('Tim', 'Goyer', 'USA', 'CA')]

In [37]:
%%sql
WITH 
    india AS 
        (SELECT * FROM customer
        WHERE country = "India"),
    sales_per_customer AS
        (SELECT customer_id, SUM(total) AS total
         FROM invoice
            GROUP BY 1)
SELECT i.first_name||" "||i.last_name customer_name, spc.total AS total_purchases
FROM india i
LEFT JOIN sales_per_customer spc ON i.customer_id = spc.customer_id
ORDER BY 1;

 * sqlite:///chinook.db
Done.

[('Manoj Pareek', 111.86999999999999), ('Puja Srivastava', 71.28)]

## A query to find the customer from each country that has spent the most money at store

In [38]:
%%sql
WITH  sales_per_customer AS
    (SELECT customer_id, SUM(total) total
     FROM invoice
     GROUP BY customer_id)
SELECT c.country country, c.first_name||" "||c.last_name customer_name, spc.total total_purchased
    FROM customer c
    INNER JOIN sales_per_customer spc ON c.customer_id = spc.customer_id
    GROUP BY 1
    HAVING total_purchased = MAX(spc.total)
    ORDER BY 1

 * sqlite:///chinook.db
Done.

[('Argentina', 'Diego Gutiérrez', 39.6),
 ('Australia', 'Mark Taylor', 81.18),
 ('Austria', 'Astrid Gruber', 69.3),
 ('Belgium', 'Daan Peeters', 60.38999999999999),
 ('Brazil', 'Luís Gonçalves', 108.89999999999998),
 ('Canada', 'François Tremblay', 99.99),
 ('Chile', 'Luis Rojas', 97.02000000000001),
 ('Czech Republic', 'František Wichterlová', 144.54000000000002),
 ('Denmark', 'Kara Nielsen', 37.61999999999999),
 ('Finland', 'Terhi Hämäläinen', 79.2),
 ('France', 'Wyatt Girard', 99.99),
 ('Germany', 'Fynn Zimmermann', 94.05000000000001),
 ('Hungary', 'Ladislav Kovács', 78.21),
 ('India', 'Manoj Pareek', 111.86999999999999),
 ('Ireland', "Hugh O'Reilly", 114.83999999999997),
 ('Italy', 'Lucas Mancini', 50.49),
 ('Netherlands', 'Johannes Van der Berg', 65.34),
 ('Norway', 'Bjørn Hansen', 72.27000000000001),
 ('Poland', 'Stanisław Wójcik', 76.22999999999999),
 ('Portugal', 'João Fernandes', 102.96000000000001),
 ('Spain', 'Enrique Muñoz', 98.01),
 ('Sweden', 'Joakim Johansson', 75.24),
 ('USA', 'Jack Smith', 98.01),
 ('United Kingdom', 'Phil Hughes', 98.01)]

In [39]:
%%sql
WITH
    customer_country_purchases AS
        (SELECT 
            i.customer_id,
            c.country,
            SUM(i.total) total_purchases
         FROM invoice i
         INNER JOIN customer c ON i.customer_id = c.customer_id
         GROUP BY 1, 2),
    country_max_purchase AS
        (SELECT 
            country, 
            MAX(total_purchases) max_purchase
         FROM customer_country_purchases
         GROUP BY 1),
    country_best_customer AS
        (SELECT 
            cmp.country,
            cmp.max_purchase,
            (SELECT ccp.customer_id
             FROM customer_country_purchases ccp
             WHERE ccp.country = cmp.COUNTRY AND cmp.max_purchase = ccp.total_purchases
            ) customer_id
        FROM country_max_purchase cmp
        )
SELECT 
    cbc.country country,
    c.first_name||" "||c.last_name customer_name,
    cbc.max_purchase total_purchased
FROM customer c
INNER JOIN country_best_customer cbc ON cbc.customer_id = c.customer_id
ORDER BY 1 ASC
LIMIT 5

 * sqlite:///chinook.db
Done.

[('Argentina', 'Diego Gutiérrez', 39.6),
 ('Australia', 'Mark Taylor', 81.18),
 ('Austria', 'Astrid Gruber', 69.3),
 ('Belgium', 'Daan Peeters', 60.38999999999999),
 ('Brazil', 'Luís Gonçalves', 108.89999999999998)]

In [40]:
%%sql
SELECT i.customer_id, c.country, SUM(i.total) total_purchases
    FROM invoice i
    INNER JOIN customer c ON i.customer_id = c.customer_id
    GROUP BY 1,2
    LIMIT 5

 * sqlite:///chinook.db
Done.

[(1, 'Brazil', 108.89999999999998),
 (2, 'Germany', 82.17),
 (3, 'Canada', 99.99),
 (4, 'Norway', 72.27000000000001),
 (5, 'Czech Republic', 144.54000000000002)]

In [41]:
%%sql
SELECT *
FROM employee
GROUP BY city, reports_to
ORDER BY last_name, reports_to

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2016-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2016-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2017-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2017-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com')]

In [42]:
%%sql
SELECT * FROM artist 
WHERE name LIKE "Re%"

 * sqlite:///chinook.db
Done.

[(127, 'Red Hot Chili Peppers'), (178, 'Regina Spektor')]

In [64]:
%%sql 
CREATE VIEW top_5_names AS 
    SELECT first_name, COUNT(customer_id) count
    FROM customer
    GROUP BY 1
    ORDER BY 2 DESC,1
    LIMIT 5;
SELECT * FROM top_5_names;

 * sqlite:///chinook.db
Done.
Done.

[('Frank', 2), ('Mark', 2), ('Aaron', 1), ('Alexandre', 1), ('Astrid', 1)]

## Force a row to last

In [69]:
%%sql
SELECT 
    *
FROM 
    (
    SELECT 
        t5.*,
        CASE 
            WHEN t5.first_name = "Mark" THEN 1
            ELSE 0
        END AS sort
    FROM top_5_names t5
    )
ORDER BY sort ASC

 * sqlite:///chinook.db
Done.

[('Frank', 2, 0),
 ('Aaron', 1, 0),
 ('Alexandre', 1, 0),
 ('Astrid', 1, 0),
 ('Mark', 2, 1)]

In [87]:
%%sql
 SELECT 
        t5.*,
        CASE 
            WHEN t5.first_name = "Mark" THEN 1
            ELSE 0
        END AS sort
    FROM top_5_names t5
ORDER BY sort ASC

 * sqlite:///chinook.db
Done.

[('Frank', 2, 0),
 ('Aaron', 1, 0),
 ('Alexandre', 1, 0),
 ('Astrid', 1, 0),
 ('Mark', 2, 1)]